{
    "addDash": [
        "Add Dash",
        "Add a dash between the first and last character in a string.",
        "These typos are created by adding a dash between the first and last character in a string."
    ],
    "addTld": [
        "Add TLD",
        "Add a tld before the right tld.",
        "These typos are created by adding a tld before the right tld. Example: google.com becomes google.com.it"
    ],
    "addition": [
        "Addition",
        "Add a characters in the domain name.",
        "These typos are created by add a characters in the domain name."
    ],
    "bitsquatting": [
        "BitSquatting",
        "Substituting a character with the set of valid characters that can be made after a single bit flip.",
        "These typos are created by substituting a character with the set of valid characters that can be made after a single bit flip. For example, facebook.com becomes bacebook.com, dacebook.com, faaebook.com,fabebook.com,facabook.com, etc."
    ],
    "changeDotDash": [
        "Change Dot to Dash",
        "Change a dot to a dash.",
        "These typos are created by changing a dot to a dash"
    ],
    "changeOrder": [
        "Change Order",
        "Change the order of letters in the each part of the domain.",
        "These typos are created by changing the order of letters in the each part of the domain."
    ],
    "commonMisspelling": [
        "Common Misspelling",
        "Change a word by is misspelling.",
        "These typos are created by changing a word by is misspelling. Over 8000 common misspellings from Wikipedia. For example, www.youtube.com becomes www.youtub.com and www.abseil.com becomes www.absail.com."
    ],
    "doubleReplacement": [
        "Double Replacement",
        "Replace consecutive letters of the domain name with letters to the immediate left and right on the keyboard.",
        "These typos are created by replacing identical, consecutive letters of the domain name with letters to the immediate left and right on the keyboard."
    ],
    "homoglyph": [
        "Homoglyph",
        "Replace characters to another character that look similar but are different.",
        "These typos are created by replacing characters to another character that look similar but are different.  An example is that the lower case l looks similar to the numeral one, e.g. l vs 1. For example, google.com becomes goog1e.com."
    ],
    "homophones": [
        "Homophones",
        "Replace word by an other who sound the same when spoken.",
        "These typos are created by changing word by an other who sound the same when spoken. Over 450 sets of words that sound the same when spoken. For example, www.base.com becomes www.bass.com."
    ],
    "keyboardInsertion": [
        "Keyboard Insertion",
        "Insert letters to the immediate left and right on the keyboard of each letter.",
        "These typos are created by inserting letters to the immediate left and right on the keyboard of each letter."
    ],
    "missingDot": [
        "Missing Dot",
        "Delete a dot from the domain name.",
        "These typos are created by deleting a dot from the domain name."
    ],
    "omission":[
        "Omission",
        "Leave out a letter of the domain name.",
        "These typos are created by leaving out a letter of the domain name, one letter at a time."
    ],
    "repetition": [
        "Repetition",
        "Repeat a letter of the domain name.",
        "These typos are created by repeating a letter of the domain name."
    ],
    "replacement": [
        "Replacement",
        "Replace each letter of the domain name with letters to the immediate left and right on the keyboard.",
        "These typos are created by replacing each letter of the domain name with letters to the immediate left and right on the keyboard. (QWERTY, AZERTY, QWERTZ, DVORAK)"
    ],
    "singularePluralize": [
        "Singulare Pluralize",
        "Make a singular domain plural and vice versa.",
        "These typos are created by making a singular domain plural and vice versa."
    ],
    "stripDash": [
        "Strip Dash",
        "Delete a dash from the domain name.",
        "These typos are created by deleting a dash from the domain name."
    ],
    "subdomain": [
        "Subdomain",
        "Place a dot in the domain name in order to create subdomain.",
        "These typos are created by placing a dot in the domain name in order to create subdomain. Example: google.com becomes goo.gle.com"
    ],
    "transposition": [
        "Transposition",
        "Swap the order of adjacent letters in the domain name.",
        "These typos are created by swapping the order of adjacent letters in the domain name."
    ],
    "vowelSwap": [
        "Vowel Swap",
        "Swap vowels within the domain name except for the first letter.",
        "These typos are created by swapping vowels within the domain name except for the first letter. For example, www.google.com becomes www.gaagle.com."
    ],
    "wrongTld": [
        "Wrong TLD",
        "Change the original top level domain to another.",
        "These typos are created by changing the original top level domain to another. For example, www.trademe.co.nz becomes www.trademe.co.mz and www.google.com becomes www.google.org Uses the 19 most common top level domains."
    ]
    
}